## Geodesics

* Let's plan our next trip together! 
* For this purpose, we have gathered a list of all the world's capital cities according to https://simplemaps.com/data/world-cities

Prerequisites:
* Basic geometry and geography knowledge.
* A bit of programming experience to transform data and think of a solution.

# Part 1: Can you get the two furthest capitals on Earth? (sea level)

In [2]:
!pip install geopy

Collecting geopy
  Downloading geopy-2.3.0-py3-none-any.whl (119 kB)
Collecting geographiclib<3,>=1.52
  Downloading geographiclib-2.0-py3-none-any.whl (40 kB)
Installing collected packages: geographiclib, geopy
Successfully installed geographiclib-2.0 geopy-2.3.0

In [39]:
import numpy as np
import pandas as pd
from geopy import distance

In [4]:
capitals_df = pd.read_csv('https://raw.githubusercontent.com/hyperc54/data-puzzles-assets/master/features/travel/worldcapitals_light.csv')

In [5]:
capitals_df.head()

          city      lat       lng
0        Tokyo  35.6839  139.7744
1      Jakarta  -6.2146  106.8451
2       Manila  14.6000  120.9833
3        Seoul  37.5600  126.9900
4  Mexico City  19.4333  -99.1333

In [6]:
capitals_df.value_counts('city')

city
Kingston      2
Abidjan       1
Phnom Penh    1
Nâ€™Djamena     1
Oranjestad    1
             ..
Hamilton      1
Hanoi         1
Harare        1
Havana        1
Zagreb        1
Length: 248, dtype: int64

In [7]:
capitals_df.loc[capitals_df['city']=='Kingston']

         city      lat       lng
123  Kingston  17.9714  -76.7931
241  Kingston -29.0569  167.9617

In [12]:
capitals_df.iloc[123, 0] = 'Kingston_1'
capitals_df.iloc[241, 0] = 'Kingston_2'
capitals_df.loc[capitals_df['city'].str.contains('Kingston')]

           city      lat       lng
123  Kingston_1  17.9714  -76.7931
241  Kingston_2 -29.0569  167.9617

In [33]:
capitals_df.loc[capitals_df['city']=='Tokyo', ['lat', 'lng']].values[0]

array([ 35.6839, 139.7744])

In [42]:
from itertools import combinations

capitals_distance = {}
for capitals_combination in combinations(capitals_df.loc[:,'city'].values, 2):
    capital_1 = capitals_df.loc[capitals_df['city']==capitals_combination[0], ['lat', 'lng']].values[0]
    capital_2 = capitals_df.loc[capitals_df['city']==capitals_combination[1], ['lat', 'lng']].values[0]
    distance_km = distance.distance(capital_1, capital_2).km
    capitals_distance[capitals_combination] = distance_km

In [52]:
import pandas as pd 

df = pd.DataFrame(data=capitals_distance, index=['distances'])
df.T.loc[:,'distances'].nlargest()

Doha    Adamstown     19865.475390
Manama  Adamstown     19863.848894
Madrid  Wellington    19855.260559
Niamey  Mata-Utu      19847.411029
Lima    Phnom Penh    19813.226227
Name: distances, dtype: float64

In [55]:
# Part 2
df.T.loc[:,'distances'].nsmallest()

Jerusalem  Al Quds                      0.061004
Rome       Vatican City                 2.689910
Marigot    Philipsburg                  6.239705
Kinshasa   Brazzaville                  7.949977
Colombo    Sri Jayewardenepura Kotte    9.367791
Name: distances, dtype: float64

Jerusalem et Al Quds correspondent au mÃªme endroit, la bonne rÃ©ponse est Rome et le Vatican.